netsuite/netsuite-connector/netsuite-connector-1.0.0/org.wso2.carbon.connector/src/test/resources/artifacts/ESB/config/soapRequests/netsuite/esb_getDataCenterUrls_negative.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="wso2.connector.netsuite">
  <soapenv:Header>
  </soapenv:Header>
  <soapenv:Body>
    <urn:apiUrl>%s(apiUrl)</urn:apiUrl>
    <urn:method>getDataCenterUrls</urn:method>
    <urn:warningAsError></urn:warningAsError>
    <urn:disableMandatoryCustomFieldValidation></urn:disableMandatoryCustomFieldValidation>
    <urn:disableSystemNotesForCustomFields></urn:disableSystemNotesForCustomFields>
    <urn:ignoreReadOnlyFields></urn:ignoreReadOnlyFields>
    <urn:partnerId></urn:partnerId>
    <urn:applicationId></urn:applicationId>
    <urn:email>%s(email)</urn:email>
    <urn:password>%s(password)</urn:password>
    <urn:account>%s(account)</urn:account>
    <urn:roleInternalId></urn:roleInternalId>
    <urn:roleExternalId></urn:roleExternalId>
    <urn:roleType></urn:roleType>
    <urn:roleName></urn:roleName>
    <urn:accountRef>
   		<account></account>
   	</urn:accountRef>
  </soapenv:Body>
</soapenv:Envelope>